---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalSupportType.CurveSupport
enum: Autodesk.Revit.DB.Structure.AnalyticalSupportType
source: html/df30d98a-d360-a74e-6862-a3db8ac715b0.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalSupportType.CurveSupport

Support along a curve.